var provinceList = [{
        name: '北京',
        cityList: [{
                name: '东城区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '崇文区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '宣武区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '朝阳区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '丰台区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '石景山区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '海淀区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '门头沟区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '房山区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '通州区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '顺义区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '昌平区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '大兴区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '怀柔区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '平谷区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '密云县',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '延庆县',
                areaList: ['中国电信', '中国联通', '中国移动']
            }
        ]
    },
    {
        name: '上海',
        cityList: [{
                name: '黄浦区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '卢湾区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '徐汇区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '长宁区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '静安区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '普陀区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '闸北区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '虹口区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '杨浦区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '闵行区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '宝山区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '嘉定区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '浦东新区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '金山区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '松江区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '青浦区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '南汇区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '奉贤区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '崇明县',
                areaList: ['中国电信', '中国联通', '中国移动']
            }
        ]
    },
    {
        name: '天津',
        cityList: [{
                name: '和平区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '河东区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '河西区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '南开区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '河北区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '红桥区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '塘沽区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '汉沽区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '大港区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '东丽区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '西青区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '津南区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '北辰区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '武清区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '宝坻区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '宁河县',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '静海县',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '蓟县',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
        ]
    },
    {
        name: '重庆',
        cityList: [

            {
                name: '万州区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '涪陵区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '渝中区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '大渡口区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '江北区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '沙坪坝区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '九龙坡区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '南岸区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '北碚区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '万盛区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '双桥区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '渝北区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '巴南区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '黔江区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '长寿区',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '南川市',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '江津市',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '合川市',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '永川市',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '綦江县',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '潼南县',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '铜梁县',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '大足县',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '荣昌县',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '璧山县',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '梁平县',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '城口县',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '丰都县',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '垫江县',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '武隆县',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '忠　县',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '开　县',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '云阳县',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '奉节县',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '巫山县',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '巫溪县',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '石柱土家族自治县',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '秀山土家族苗族自治县',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '酉阳土家族苗族自治县',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '彭水苗族土家族自治',
                areaList: ['中国电信', '中国联通', '中国移动']
            }
        ]
    },
    {
        name: '四川',
        cityList: [{
                name: '成都市',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '自贡市',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '攀枝花市',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '泸州市',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '德阳市',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '绵阳市',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '广元市',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '遂宁市',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '内江市',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '乐山市',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '南充市',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '眉山市',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '宜宾市',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '广安市',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '达州市',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '雅安市',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '巴中市',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '资阳市',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '阿坝藏族羌族自治州',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '甘孜藏族自治州',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '凉山彝族自治州',
                areaList: ['中国电信', '中国联通', '中国移动']
            },
            {
                name: '贵州',
                cityList: [{
                        name: '贵阳市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '六盘水市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '遵义市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '安顺市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '铜仁地区',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '黔西南布依族苗族自治州',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '毕节地区',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '黔东南苗族侗族自治州',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '黔南布依族苗族自治州',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    }
                ]
            },
            {
                name: '云南',
                cityList: [{
                        name: '昆明市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '曲靖市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '玉溪市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '保山市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '昭通市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '丽江市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '思茅市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '临沧市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '楚雄彝族自治州',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '红河哈尼族彝族自治州',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '文山壮族苗族自治州',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '西双版纳傣族自治州',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '大理白族自治州',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '德宏傣族景颇族自治州',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '迪庆藏族自治州',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    }
                ]
            },
            {
                name: '西藏',
                cityList: [{
                        name: '拉萨市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '昌都地区',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '山南地区',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '日喀则地区',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '那曲地区',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '阿里地区',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '林芝地区',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    }
                ]
            },
            {
                name: '河南',
                cityList: [{
                        name: '郑州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '开封市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '洛阳市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '平顶山市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '安阳市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '鹤壁市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '新乡市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '焦作市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '濮阳市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '许昌市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '漯河市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '三门峡市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '南阳市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '商丘市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '信阳市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '周口市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '驻马店市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    }
                ]
            },
            {
                name: '湖北',
                cityList: [{
                        name: '武汉市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '黄石市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '十堰市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '宜昌市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '襄樊市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '鄂州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '荆门市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '孝感市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '荆州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '黄冈市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '咸宁市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '随州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '恩施土家族苗族自治州',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '省直辖行政单位',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    }
                ]
            },
            {
                name: '湖南',
                cityList: [{
                        name: '长沙市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '株洲市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '湘潭市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '衡阳市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '邵阳市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '岳阳市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '常德市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '张家界市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '益阳市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '郴州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '永州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '怀化市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '娄底市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '湘西土家族苗族自治州',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    }
                ]
            },
            {
                name: '广东',
                cityList: [{
                        name: '广州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '韶关市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '深圳市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '珠海市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '汕头市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '佛山市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '江门市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '湛江市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '茂名市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '肇庆市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '惠州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '梅州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '汕尾市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '河源市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '阳江市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '清远市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '东莞市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '中山市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '潮州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '揭阳市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '云浮市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    }
                ]
            },
            {
                name: '广西',
                cityList: [{
                        name: '南宁市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '柳州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '桂林市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '梧州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '北海市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '防城港市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '钦州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '贵港市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '玉林市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '百色市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '贺州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '河池市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '来宾市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '崇左市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    }
                ]
            },
            {
                name: '陕西',
                cityList: [{
                        name: '西安市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '铜川市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '宝鸡市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '咸阳市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '渭南市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '延安市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '汉中市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '榆林市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '安康市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '商洛市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    }
                ]
            },
            {
                name: '甘肃',
                cityList: [{
                        name: '兰州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '嘉峪关市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '金昌市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '白银市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '天水市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '武威市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '张掖市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '平凉市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '酒泉市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '庆阳市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '定西市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '陇南市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '临夏回族自治州',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '甘南藏族自治州',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    }
                ]
            },
            {
                name: '青海',
                cityList: [{
                        name: '西宁市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '海东地区',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '海北藏族自治州',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '黄南藏族自治州',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '海南藏族自治州',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '果洛藏族自治州',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '玉树藏族自治州',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '海西蒙古族藏族自治州',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    }
                ]
            },
            {
                name: '宁夏',
                cityList: [{
                        name: '银川市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '石嘴山市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '吴忠市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '固原市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '中卫市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    }
                ]
            },
            {
                name: '新疆',
                cityList: [{
                        name: '乌鲁木齐市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '克拉玛依市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '吐鲁番地区',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '哈密地区',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '昌吉回族自治州',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '博尔塔拉蒙古自治州',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '巴音郭楞蒙古自治州',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '阿克苏地区',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '克孜勒苏柯尔克孜自治州',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '喀什地区',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '和田地区',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '伊犁哈萨克自治州',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '塔城地区',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '阿勒泰地区',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '省直辖行政单位',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    }
                ]
            },
            {
                name: '河北',
                cityList: [{
                        name: '石家庄市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '唐山市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '秦皇岛市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '邯郸市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '邢台市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '保定市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '张家口市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '承德市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '沧州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '廊坊市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '衡水市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    }
                ]
            },
            {
                name: '山西',
                cityList: [{
                        name: '太原市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '大同市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '阳泉市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '长治市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '晋城市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '朔州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '晋中市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '运城市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '忻州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '临汾市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '吕梁市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    }
                ]
            },
            {
                name: '内蒙古',
                cityList: [{
                        name: '呼和浩特市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '包头市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '乌海市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '赤峰市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '通辽市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '鄂尔多斯市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '呼伦贝尔市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '巴彦淖尔市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '乌兰察布市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '兴安盟',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '锡林郭勒盟',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '阿拉善盟',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    }
                ]
            },
            {
                name: '江苏',
                cityList: [{
                        name: '南京市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '无锡市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '徐州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '常州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '苏州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '南通市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '连云港市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '淮安市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '盐城市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '扬州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '镇江市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '泰州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '宿迁市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    }
                ]
            },
            {
                name: '浙江',
                cityList: [{
                        name: '杭州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '宁波市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '温州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '嘉兴市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '湖州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '绍兴市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '金华市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '衢州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '舟山市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '台州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '丽水市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    }
                ]
            },
            {
                name: '安徽',
                cityList: [{
                        name: '合肥市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '芜湖市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '蚌埠市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '淮南市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '马鞍山市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '淮北市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '铜陵市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '安庆市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '黄山市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '滁州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '阜阳市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '宿州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '巢湖市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '六安市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '亳州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '池州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '宣城市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    }
                ]
            },
            {
                name: '福建',
                cityList: [{
                        name: '福州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '厦门市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '莆田市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '三明市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '泉州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '漳州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '南平市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '龙岩市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '宁德市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    }
                ]
            },
            {
                name: '江西',
                cityList: [{
                        name: '南昌市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '景德镇市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '萍乡市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '九江市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '新余市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '鹰潭市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '赣州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '吉安市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '宜春市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '抚州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '上饶市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    }
                ]
            },
            {
                name: '山东',
                cityList: [{
                        name: '济南市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '青岛市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '淄博市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '枣庄市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '东营市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '烟台市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '潍坊市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '济宁市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '泰安市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '威海市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '日照市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '莱芜市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '临沂市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '德州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '聊城市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '滨州市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '荷泽市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    }
                ]
            },
            {
                name: '辽宁',
                cityList: [{
                        name: '沈阳市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '大连市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '鞍山市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '抚顺市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '本溪市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '丹东市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '锦州市',
                        areaList: ['中国电信', '中国联通', '中国移动]
                    },
                    {
                        name: '营口市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '阜新市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '辽阳市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '盘锦市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '铁岭市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '朝阳市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '葫芦岛市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    }
                ]
            },
            {
                name: '吉林',
                cityList: [{
                        name: '长春市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '吉林市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '四平市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '辽源市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '通化市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '白山市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '松原市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '白城市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '延边朝鲜族自治州',
                        areaList: ['中国电信', '中国联通', '中国移动'']
                    }
                ]
            },
            {
                name: '黑龙江',
                cityList: [{
                        name: '哈尔滨市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '齐齐哈尔市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '鸡西市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '鹤岗市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '双鸭山市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '大庆市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '伊春市',
                        areaList: ['中国电信', '中国联通', '中国移动'']
                    },
                    {
                        name: '佳木斯市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '七台河市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '牡丹江市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '黑河市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '绥化市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '大兴安岭地区',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    }
                ]
            },
            {
                name: '海南',
                cityList: [{
                        name: '海口市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '三亚市',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    },
                    {
                        name: '省直辖县级行政单位',
                        areaList: ['中国电信', '中国联通', '中国移动']
                    }
                ]
            },
            {
                name: '台湾',
                cityList: []
            },
            {
                name: '香港',
                cityList: []
            },
            {
                name: '澳门',
                cityList: []
            }
        ]
    }
]